Autodesk.Revit.DB.Visual.Wave.TextureAngle
The property labeled "Angle" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray3d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetZ
The property labeled "Offset Z" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveRandomSeed
The property labeled "Random Seed" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyInteger" within the range of "0, 65535".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WavePhase
The property labeled "Phase" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 10000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveAmplitude
The property labeled "Amplitude" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 10000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveWaveLenMax
The property labeled "Len Max" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveWaveLenMin
The property labeled "Len Min" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveWaveRadius
The property labeled "Radius" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveNumWaveSets
The property labeled "Number" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyInteger" within the range of "1, 50".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveDistribution
The property labeled "Distribution" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaveDistributionType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveColor2
The property labeled "Color 2" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave.WaveColor1
The property labeled "Color 1" from the "Wave" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Wave
Represents the properties of materials.
Since:
2018.1